In [3]:
#importing Libraries
import pandas as pd
import numpy as np

In [4]:
#importing dataset
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [5]:
#To see what our dataset entails: Analysis shows that the dataset is about lecturers salaries in an education setting
#data collected includes their rank, discipline, phd, service, sex, and salary.
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [7]:
#To see the dimensionality of the data set: Analysis shows that there are 78 rows and 6 coulums in this dataset
df.shape

(78, 6)

In [8]:
#To see the types of data: Analysis shows that rank, discipline, and sex are categorical data, 
#while phd, service and salary are numerical data
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [24]:
#To check through data and be sure no null colums
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [10]:
#To get the descriptive statistics for the numerical column: Few intution can be made from this analysis, like the 
#highest salary of a lecturer from this dataset is 186960 and the lowest is 57800, with the average pay being 108023.78
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [11]:
#Grouping our data set by the rank column: To gain intution from the various ranks of the lecturers.
df_rank = df.groupby(['rank'])

In [27]:
#To ascertain the number of frequency in each rank. In this dataset we have 13 AssocProf, 19 AsstProf and 46 Prof.
#It can be argued that this data is skewed towards the prof as they have move data than the other categories
df_rank.count()

           discipline  phd  service  sex  salary
rank
AssocProf          13   13       13   13      13
AsstProf           19   19       19   19      19
Prof               46   46       46   46      46

In [12]:
#Getting the average of the numerical data from the rank groupings: Analysis shows that a Prof averagely has an higer salary
#as well as an higher years in service and higher number of phd, followed by the AssocProf and then the AsstProf.
#Intitution gained from the data shows that various rank is a function of number of phd and number of years in service which
#in turn also determines the amount being paid as salary as profs who have averagely more phd and 
#years of service would averagely earn more than AssocProf and AsstProf. We can also deduce from this that Prof average
#salary is higher than the average salary of all lecurers combined which was 108023.78
df_rank.mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [13]:
#Grouping our data set by the sex column: To gain intution from the various sex of the lecturers.
df_sex = df.groupby(['sex'])

In [26]:
#To ascertain number of male and female lecturers. Analysis shows there are equal numbers of male and females
df_sex.count()

        rank  discipline  phd  service  salary
sex
Female    39          39   39       39      39
Male      39          39   39       39      39

In [16]:
#Getting the average of the numerical data from the sex groupings: Analysis shows that males earn more on the average
#than females in this dataset however the male higher earning is related to the fact that they have longer service 
#years and higher amounts of phd on the average than their female counterparts.
df_sex.mean()

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [17]:
#Grouping our data set by the discipline column: To gain intution from the various disciplines of the lecturers.
df_discipline = df.groupby(['discipline'])

In [25]:
#To ascertain the number of frequency in each discipline. In this dataset we have 36 lecturers in Discipline A
#and 42 in discipline B.
df_discipline.count()

            rank  phd  service  sex  salary
discipline
A             36   36       36   36      36
B             42   42       42   42      42

In [19]:
#Getting the average of the numerical data from the discipline groupings: One of the intitution that can be gotten from
#this is that according to the dataset it can be argued that lecturers in discipline B earn more even with lower average
#amount of phd and service year. Therefore, discipline B might be a special skills discipline.
df_discipline.mean()

                  phd    service         salary
discipline
A           21.527778  15.722222   98331.111111
B           18.142857  14.476190  116331.785714

In [ ]:
#Conclusion

#In this data set we can deduce that in this educational institution lecturers are grouped into three; Prof, AssocProf,
#and AsstProf. The institution has more prof than the other two lecturers categories combined. The dataset also shows
#that the Prof earn more than other categories of lecturers on an average and the reason for this might not be far
#fetched as Prof also have an higher average amount of Phd and service year. The Dataset also show equal distribution of
#male and female lecturers in the school, however, analysis shows that male lecturers have higher salaries on an average
#this however, cannont be unconnected to the fact that female lecturers have a lower average phd and service year. 
#More inestigation can be carried out as to the reason for that. Futher query into the dataset shows that there are two
#major disciplines in this institution, with more lecturers coming from discipline B. However, despite the low average phd
#and year of service, lecturers in discipline B can still be seen to earn higher salaries which leads to the conclusion 
#that discipline B is a special skills discipline which pays more maybe due to the rigority in the discipline. However this 
#can be subjected to further research to understand the rigor present in both discipline.